DL-with-Bayesian-Principles.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-12-09 Mon 10:09 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Sam Partee" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgbaed1c7">1. Bayesian Learning vs Deep Learning</a>
<ul>
<li><a href="#org0e0fde6">1.1. BL models</a></li>
<li><a href="#org705cef2">1.2. DL Models</a></li>
<li><a href="#orgb22e04b">1.3. Bayesian Principles</a></li>
<li><a href="#org75c2c9d">1.4. Bringing the two worlds together</a>
<ul>
<li><a href="#org4a73180">1.4.1. RMSProp and Adam from Bayes</a></li>
<li><a href="#org2c2dab8">1.4.2. Bayes as optimization</a></li>
</ul>
</li>
<li><a href="#org771a0fa">1.5. Uncertainty</a></li>
<li><a href="#orge39ae93">1.6. Some bayesian deep learning mthods</a></li>
<li><a href="#org046f7c5">1.7. Variational inference methods</a></li>
<li><a href="#org9dbad84">1.8. Variational Online Gauss-Newton: VOGN</a></li>
<li><a href="#orge95f987">1.9. Model View vs. Data View</a></li>
</ul>
</li>
<li><a href="#org982cd6b">2. Papers</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgbaed1c7" class="outline-2">
<h2 id="orgbaed1c7"><span class="section-number-2">1</span> Bayesian Learning vs Deep Learning</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Bridge the gap between human learning and deep learning</li>
<li>Author states biased disclaimer</li>
<li>Author paper - "Learning-Algorithms from Bayesian Principles"</li>
<li><a href="https://emtiyaz.github.io/">Author site</a></li>
<li><a href="https://github.com/emtiyaz">Author Github</a></li>
</ul>
</div>
<div id="outline-container-org0e0fde6" class="outline-3">
<h3 id="org0e0fde6"><span class="section-number-3">1.1</span> BL models</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>GP, BayesNets, PGMS,</li>
<li>Trained with prior/posterior</li>
<li>Can estimate uncertainty</li>
<li>Sequential active online learning (lifelong learning)</li>
<li>Integration (Global) allows for uncertainty quantification</li>
</ul>
</div>
</div>
<div id="outline-container-org705cef2" class="outline-3">
<h3 id="org705cef2"><span class="section-number-3">1.2</span> DL Models</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Frequentist</li>
<li>Stocastic, Scalable training</li>
<li>better with larger more comlex models</li>
<li>Differentiation (local) aka black box</li>
</ul>
</div>
</div>
<div id="outline-container-orgb22e04b" class="outline-3">
<h3 id="orgb22e04b"><span class="section-number-3">1.3</span> Bayesian Principles</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li>Sample -&gt; prior</li>
<li>Score -&gt; likelihood</li>
<li>Normalize -&gt; posterior = likelihood x Prior</li>
<li>Bayesian learning is able to account for changes in data that
cannot be accounted for in typical batch style learning.</li>
</ol>
</div>
</div>

<div id="outline-container-org75c2c9d" class="outline-3">
<h3 id="org75c2c9d"><span class="section-number-3">1.4</span> Bringing the two worlds together</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Adding to loss by taking loss from a distribution</li>
<li>Second order methods can be dervied from bayes by choosing a mutlivariate Gaussian</li>
<li>Showed gradient descent, and newtons method from Bayes</li>
</ul>
</div>

<div id="outline-container-org4a73180" class="outline-4">
<h4 id="org4a73180"><span class="section-number-4">1.4.1</span> RMSProp and Adam from Bayes</h4>
<div class="outline-text-4" id="text-1-4-1">
<ul class="org-ul">
<li>Choose gaussian from diagonal covariance</li>
<li>Replace Hessian by square of gradients</li>
<li>Add square root for scaling vector</li>
</ul>
</div>
</div>

<div id="outline-container-org2c2dab8" class="outline-4">
<h4 id="org2c2dab8"><span class="section-number-4">1.4.2</span> Bayes as optimization</h4>
<div class="outline-text-4" id="text-1-4-2">
<ul class="org-ul">
<li>Expecctation of the loss function over a distribution plus entropy
creates variational inference.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org771a0fa" class="outline-3">
<h3 id="org771a0fa"><span class="section-number-3">1.5</span> Uncertainty</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>What the model doesnt know</li>
<li>gave example of the frequency of earthquakes and two lines of fit.</li>
<li>quantifying uncertainty avoids bias in data</li>
</ul>
</div>
</div>
<div id="outline-container-orge39ae93" class="outline-3">
<h3 id="orge39ae93"><span class="section-number-3">1.6</span> Some bayesian deep learning mthods</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>MC-Dropout [1]</li>
<li>SWAG [2]</li>
</ul>
</div>
</div>
<div id="outline-container-org046f7c5" class="outline-3">
<h3 id="org046f7c5"><span class="section-number-3">1.7</span> Variational inference methods</h3>
<div class="outline-text-3" id="text-1-7">
<ul class="org-ul">
<li>Enable flexible distributions</li>
<li>do not scale well to large problems (imagenet scale)</li>
</ul>
</div>
</div>

<div id="outline-container-org9dbad84" class="outline-3">
<h3 id="org9dbad84"><span class="section-number-3">1.8</span> Variational Online Gauss-Newton: VOGN</h3>
<div class="outline-text-3" id="text-1-8">
<ul class="org-ul">
<li>improve RMSprop with a bayesian touch</li>
</ul>
</div>
</div>

<div id="outline-container-orge95f987" class="outline-3">
<h3 id="orge95f987"><span class="section-number-3">1.9</span> Model View vs. Data View</h3>
<div class="outline-text-3" id="text-1-9">
<ul class="org-ul">
<li>Most ML models have the "model view" which can only see the line between
the two classes.</li>
<li>Bayesian models see the datapoints which are close to the line which is
much more important than the line itself</li>
<li>this constitutes the difference between the view of model and data</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org982cd6b" class="outline-2">
<h2 id="org982cd6b"><span class="section-number-2">2</span> Papers</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>"Dropout as a bayesian approximation" [1]</li>
<li>"A simple baseline for bayesian uncertainty in deep learning" [2]</li>
<li>"Practical variational inference for neural networks"</li>
<li>"Weight uncertainty in neural networks"</li>
<li>VOGN: "Fast and scalable Bayesian deep learning by weight pertubation in Adam" Khan et al</li>
<li>"Overcoming catastrophic forgetting" kirkpatrick - Elastic Weight Consolidation paper</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Sam Partee</p>
<p class="date">Created: 2019-12-09 Mon 10:09</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
